In [126]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [127]:
dataset = pd.read_csv(r'C:\Machine_learning_projects\customer_segmentation\archive\Train.csv')
dataset.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [128]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     7928 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        7990 non-null   object
 5   Profession       7944 non-null   object
 6   Work_Experience  7239 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      7733 non-null   float64
 9   Var_1            7992 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB

In [129]:
cat=[]
for i in dataset.columns:
    if dataset[i].dtype=="object":
        cat.append(i)

In [130]:
# from sklearn.impute import SimpleImputer
# imputer = SimpleImputer(strategy = "most_frequent",missing_values=np.nan)

for i in cat:
    dataset[i]=dataset[i].fillna("Missing")

In [131]:
dataset[cat].isnull().sum()

Gender            0
Ever_Married      0
Graduated         0
Profession        0
Spending_Score    0
Var_1             0
Segmentation      0
dtype: int64

In [132]:
num=[]
for i in dataset.columns:
    if dataset[i].dtype!="object":
        num.append(i)

In [133]:
dataset[num].isnull().sum()

ID                   0
Age                  0
Work_Experience    829
Family_Size        335
dtype: int64

In [134]:
for i in num:
    median=dataset[i].median()
    dataset[i]=dataset[i].fillna(median)

In [135]:
dataset["Age"]=pd.qcut(dataset.Age,5)

dataset["Family_Size"]=pd.qcut(dataset.Family_Size,3)

In [136]:


dataset["Work_Experience"]=pd.qcut(dataset.Work_Experience,2)

In [137]:
X=dataset.drop(["Segmentation","ID"],axis=1)
y=dataset["Segmentation"]

In [138]:
cat

['Gender',
 'Ever_Married',
 'Graduated',
 'Profession',
 'Spending_Score',
 'Var_1',
 'Segmentation']

In [139]:
# dataset_dummies =pd.get_dummies(X)
# dataset_dummies.head()

In [140]:
from kmodes.kmodes import KModes

In [141]:
X.isnull().sum()

Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
dtype: int64

In [142]:
# from sklearn.preprocessing import StandardScaler
# ss=StandardScaler()
# dataset_scale=ss.fit_transform(X)

In [149]:
from tqdm import tqdm_notebook

In [156]:
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
wcss=[]
for i in tqdm_notebook(range(4,5)):
    kmeans=KModes(n_clusters=i)
    kmeans.fit(X)
    clusters=kmeans.predict(X)
    
    wcss.append(kmeans.cost_)

C:\Users\kunal\AppData\Local\Temp/ipykernel_65528/833098433.py:4: TqdmDeprecationWarning: This function will be removed in tqdm==5.0.0
Please use `tqdm.notebook.tqdm` instead of `tqdm.tqdm_notebook`
  for i in tqdm_notebook(range(4,5)):

  0%|          | 0/1 [00:00<?, ?it/s]

In [157]:
dataset["clusters"]=clusters

In [158]:
dataset.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation,clusters
0,462809,Male,No,"(17.999, 28.0]",No,Healthcare,"(-0.001, 1.0]",Low,"(3.0, 9.0]",Cat_4,D,1
1,462643,Female,Yes,"(37.0, 45.0]",Yes,Engineer,"(-0.001, 1.0]",Average,"(2.0, 3.0]",Cat_4,A,2
2,466315,Female,Yes,"(57.0, 89.0]",Yes,Engineer,"(-0.001, 1.0]",Low,"(0.999, 2.0]",Cat_6,B,0
3,461735,Male,Yes,"(57.0, 89.0]",Yes,Lawyer,"(-0.001, 1.0]",High,"(0.999, 2.0]",Cat_6,B,0
4,462669,Female,Yes,"(37.0, 45.0]",Yes,Entertainment,"(-0.001, 1.0]",High,"(3.0, 9.0]",Cat_6,A,2

In [177]:
dataset.loc[dataset.clusters==0].mode()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation,clusters
0,458982,Male,Yes,"(57.0, 89.0]",Yes,Artist,"(-0.001, 1.0]",Low,"(0.999, 2.0]",Cat_6,C,0.0
1,458983,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,458984,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,458987,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,458989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
4586,467957,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4587,467961,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4588,467967,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4589,467969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4590,467974,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [161]:
dataset_1 = dataset.loc[dataset["clusters"]==1]

In [170]:
cols_dont_want=["ID","Segmentation","clusters"]

In [173]:
cols_we_want=[i for i in dataset.columns if i not in cols_dont_want]

In [174]:
cols_we_want

['Gender',
 'Ever_Married',
 'Age',
 'Graduated',
 'Profession',
 'Work_Experience',
 'Spending_Score',
 'Family_Size',
 'Var_1']

In [175]:
index=["1","2","3","4"]

In [176]:
pd.DataFrame(kmeans.cluster_centroids_,columns=cols_we_want,index=index)

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
1,Male,Yes,"(57.0, 89.0]",Yes,Artist,"(-0.001, 1.0]",Low,"(0.999, 2.0]",Cat_6
2,Female,No,"(17.999, 28.0]",No,Healthcare,"(-0.001, 1.0]",Low,"(3.0, 9.0]",Cat_6
3,Female,Yes,"(37.0, 45.0]",No,Entertainment,"(-0.001, 1.0]",Average,"(2.0, 3.0]",Cat_6
4,Female,No,"(45.0, 57.0]",Yes,Doctor,"(-0.001, 1.0]",Low,"(2.0, 3.0]",Cat_3